In [1]:
import numpy as np
s1=np.random.randint(10, size=5)
s2=np.random.randint(10, size=5)
s3=np.random.randint(10, size=5)

In [2]:
sozluk={"var1":s1,"var2":s2,"var3":s3}

In [3]:
sozluk

{'var1': array([3, 3, 2, 8, 4]),
 'var2': array([8, 5, 2, 1, 0]),
 'var3': array([0, 4, 0, 2, 5])}

In [6]:
import pandas as pd

In [7]:
df=pd.DataFrame(sozluk)

In [8]:
df

   var1  var2  var3
0     3     8     0
1     3     5     4
2     2     2     0
3     8     1     2
4     4     0     5

In [9]:
df[0:2]

   var1  var2  var3
0     3     8     0
1     3     5     4

In [10]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [11]:
# indexi yeniden ata

In [13]:
df.index=["a","b","c","d","e"]

In [14]:
df

   var1  var2  var3
a     3     8     0
b     3     5     4
c     2     2     0
d     8     1     2
e     4     0     5

In [15]:
df["b":"d"]

   var1  var2  var3
b     3     5     4
c     2     2     0
d     8     1     2

In [16]:
# silme drop

In [17]:
df.drop("a", axis=0)

   var1  var2  var3
b     3     5     4
c     2     2     0
d     8     1     2
e     4     0     5

In [18]:
# "a" yi silmis oldu .....ama ana hata df degismedi

In [19]:
df

   var1  var2  var3
a     3     8     0
b     3     5     4
c     2     2     0
d     8     1     2
e     4     0     5

In [20]:
# kalici silme

In [22]:
df.drop("a",axis=0, inplace=True)

In [24]:
df

   var1  var2  var3
b     3     5     4
c     2     2     0
d     8     1     2
e     4     0     5

In [25]:
# fancy    fantastik silme

In [26]:
l=["c","e"]

In [28]:
df.drop(l, axis=0)

   var1  var2  var3
b     3     5     4
d     8     1     2

In [29]:
# degisken icn

In [30]:
df

   var1  var2  var3
b     3     5     4
c     2     2     0
d     8     1     2
e     4     0     5

In [31]:
"var1"in df

True

In [33]:
l=[] # icine birseyler yaz

In [34]:
for i in l:
    prin(i in df)  # listede istenilenin df de varmi yok mu sorar

In [35]:
# df[] k√∂seli parantes olun ca   bir elemana ulasacagimizi anlar

In [37]:
df["var1"]

b    3
c    2
d    8
e    4
Name: var1, dtype: int32

In [38]:
# yeni bie df["var4"] olusturacagm

In [39]:
df["var4"]=df["var1"]/df["var2"]

In [40]:
df

   var1  var2  var3  var4
b     3     5     4   0.6
c     2     2     0   1.0
d     8     1     2   8.0
e     4     0     5   inf

In [48]:
df.drop("var4",axis=1, inplace=True)

In [49]:
df

   var1  var2  var3
b     3     5     4
c     2     2     0
d     8     1     2
e     4     0     5

In [ ]:
# axis =0  satir siler -----  axis=1  sutun siler